snlkuharlocal/src/DataProcessors/СкорректироватьКомплектующие/СкорректироватьКомплектующие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СкорректироватьКомплектующие</name>
  <attributes>
    <name>ДокОбъект</name>
    <type>
      <types>DocumentRef.ЗаявкаНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>КП_фиктивный</name>
    <type>
      <types>DocumentRef.КонтрактСПроизводителем</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗАП_фиктивный</name>
    <type>
      <types>DocumentRef.ЗаявкаНаПроизводство</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Комплектующие</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Комплектующее</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КомплектующиеКП</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Комплектующее</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КомплектующиеЗАП</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Комплектующее</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Расхождения</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Комплектующее</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Хватает</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

snlkuharlocal/src/DataProcessors/СкорректироватьКомплектующие/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Параметры.КлючНазначенияИспользования = "" Тогда
		ЭтаФорма.Закрыть();
		ПоказатьПредупреждение(,"Это служебная форма, открывается только по кнопочке!!!");
		Возврат;
	КонецЕсли;
	
	УправлениеВидимостью();

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДокОбъект") Тогда
		
		Объект.ДокОбъект = Параметры.ДокОбъект;
		
		Если Объект.ДокОбъект <> Неопределено Тогда
			
			Параметры.КлючНазначенияИспользования = "ДокОбъектЗаполнен";
		
			тзВыборка = Обработки.СкорректироватьКомплектующие.РассчитатьКомплектующие(Объект.ДокОбъект);
			
			Если ТипЗнч(тзВыборка) = Тип("ТаблицаЗначений") Тогда
		
				Объект.Комплектующие.Загрузить(тзВыборка);
				
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостью()
	
	Элементы.ЗагрузитьФиктивныеДокументы.Доступность = ((Объект.Расхождения.Количество() = 0 ИЛИ ХватаетКомплектующих())
		И Объект.Комплектующие.Количество() > 0
		И Объект.КомплектующиеКП.Количество() > 0);
		
	Элементы.КнопкаОбновитьТовары.Доступность = ((Объект.Расхождения.Количество() = 0 ИЛИ ХватаетКомплектующих())
		И Объект.Комплектующие.Количество() > 0
		И Объект.КомплектующиеКП.Количество() > 0);
		
	Элементы.КнопкаПодогнатьКоличество.Доступность = ЗначениеЗаполнено(Объект.КП_фиктивный);
	
	Элементы.КнопкаВыровнятьПоКП.Доступность = ЗначениеЗаполнено(Объект.ЗАП_фиктивный) И Объект.КомплектующиеКП.Количество() > 0;
	
КонецПроцедуры

&НаКлиенте
Процедура РасхожденияПослеУдаления(Элемент)
	УправлениеВидимостью();
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////////////////////////////
#Область ОбработкаВыбора

&НаКлиенте
Процедура КП_фиктивныйОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		
		тзКП = Обработки.СкорректироватьКомплектующие.РассчитатьКомплектующие(ВыбранноеЗначение);
		ЗагрузитьТЧ_НаСервере(тзКП, "КомплектующиеКП");
		ЗаполнитьРасхождения();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомплектующиеКПКомплектующееОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.КомплектующиеКП.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) И ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.Номенклатура = Обработки.СкорректироватьКомплектующие.ПодобратьНоменклатуруКП_ПоНоменклатуреЗАП(ВыбранноеЗначение, ВыгрузитьТЧ_НаСервере());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗАП_фиктивныйОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		
		тзКП = Обработки.СкорректироватьКомплектующие.РассчитатьКомплектующие(ВыбранноеЗначение);
		ЗагрузитьТЧ_НаСервере(тзКП, "КомплектующиеЗАП");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
///////////////////////////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ЗагрузитьТЧ_НаСервере(тзВыборка, ИмяТабличнойЧасти = "КомплектующиеКП")
	Объект[ИмяТабличнойЧасти].Загрузить(тзВыборка);	
КонецПроцедуры

&НаСервере
Функция ВыгрузитьТЧ_НаСервере(ИмяТабличнойЧасти = "Комплектующие")
	Возврат Объект[ИмяТабличнойЧасти].Выгрузить();
КонецФункции

&НаСервере
Процедура ЗаполнитьРасхождения()
	
	тзКомплектующие = Объект.Комплектующие.Выгрузить(, "Комплектующее, Количество");
	тзКомплектующиеКП = Объект.КомплектующиеКП.Выгрузить(, "Комплектующее, Количество");
	
	Для Каждого Стр ИЗ тзКомплектующие Цикл
		Стр.Количество = - Стр.Количество;
	КонецЦикла;
		
	тзРасхождения = ЗаполнениеДокументов.РазницаТаблицЗначений(тзКомплектующие, тзКомплектующиеКП,
		"Комплектующее,Количество");
	
	тзРасхождения.Свернуть("Комплектующее", "Количество");
	
	//МассивСтрок = тзРасхождения.НайтиСтроки(Новый Структура("Количество", 0));
	
	//Для Каждого ЭлементМассива Из МассивСтрок Цикл
	//	тзРасхождения.Удалить(ЭлементМассива);
	//КонецЦикла;
	
	тзРасхождения.Колонки.Добавить("Хватает", Новый ОписаниеТипов("Булево"));
	тзРасхождения.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	
	Для Каждого Стр ИЗ тзРасхождения Цикл
		Стр.Номенклатура = Стр.Комплектующее; 
		Если Стр.Количество >= 0 Тогда
			Стр.Хватает = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Объект.Расхождения.Загрузить(тзРасхождения);
	
	УправлениеВидимостью();

КонецПроцедуры

&НаСервере
Функция ХватаетКомплектующих()
	
	Для Каждого Стр ИЗ Объект.Расхождения Цикл
		Если Стр.Хватает = Ложь Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ЭтоСпайка(Номенклатура)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Комплектующие.Номенклатура КАК Номенклатура
	|ИЗ
	|	Справочник.Номенклатура.Коплектующие КАК Комплектующие
	|ГДЕ
	|	Комплектующие.Ссылка = &Номенклатура";
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если НЕ Результат.Пустой() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ПодогнатьКоличествоКП_Сервер()
	
	// Если в Фиктивном КП не хватает Количества - убираем из основного ЗАПа Количество, чтобы хватало на Спайку
	
	Для Каждого Стр ИЗ Объект.Расхождения Цикл
		
		Если Стр.Количество < 0 Тогда
			
			Если ЭтоСпайка(Стр.Номенклатура) Тогда
				НайденныеСтрокиЗАП = Объект.Расхождения.НайтиСтроки(Новый Структура("Комплектующее", Стр.Комплектующее));
				КоличествоКВычитанию = Модуль(Стр.Количество);
				
			
			
			Для Каждого НСтр ИЗ НайденныеСтрокиЗАП Цикл
				
				Если КоличествоКВычитанию > НСтр.Количество Тогда
					КоличествоКВычитанию = КоличествоКВычитанию - НСтр.Количество;
					НСтр.Количество = 0;
				ИначеЕсли КоличествоКВычитанию < НСтр.Количество Тогда
					НСтр.Количество = Нстр.Количество - КоличествоКВычитанию;
					Прервать;
				КонецЕсли;
				
				
			КонецЦикла;
			
				
			Иначе
				НайденныеСтрокиЗАП = Объект.Комплектующие.НайтиСтроки(Новый Структура("Номенклатура,Комплектующее", Стр.Номенклатура, Стр.Комплектующее));
				Для Каждого НСтр ИЗ НайденныеСтрокиЗАП Цикл
					НСтр.Количество = ?(НСтр.Количество - Модуль(Стр.Количество) < 0, 0, НСтр.Количество - Модуль(Стр.Количество));	
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаполнитьРасхождения();
	
	// теперь в Расхождениях должны остаться одни "+" (если в КП количество больше, чем в ЗАП)
	// Теперь отнимаем Количество, которое осталось в ЗАП из Количества в Фиктивном КП
	// Какие-то строки будут 0, какие то больше 0
	
	Для Каждого Стр ИЗ Объект.Расхождения Цикл
		
		НайденныеСтрокиКП = Объект.КомплектующиеКП.НайтиСтроки(Новый Структура("Номенклатура,Комплектующее", Стр.Номенклатура, Стр.Комплектующее));
		Для Каждого НСтр ИЗ НайденныеСтрокиКП Цикл
			НСтр.Количество = Модуль(Стр.Количество);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТЧ_ПоСсылке_НаСервере(ДокСсылка, ИмяТабличнойЧасти = "Товары", тзВыборка)
	
	ДокОбъект = Неопределено;
	Если ЗаполнениеДокументов.ЭтоСсылка(ТипЗнч(ДокСсылка)) Тогда
		ДокОбъект = ДокСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	Если ДокОбъект <> Неопределено Тогда
		
		Для Каждого Стр ИЗ тзВыборка Цикл
			
			НайденныеСтроки = ДокОбъект[ИмяТабличнойЧасти].НайтиСтроки(Новый Структура("Номенклатура", Стр.Комплектующее));
			
			Для Каждого НСтр ИЗ НайденныеСтроки Цикл
				
				НСтр.Количество = Стр.Количество;
				
				Если ЕстьРеквизитТабЧастиДокумента("Заявка", ДокОбъект.Метаданные(), ИмяТабличнойЧасти) Тогда
					НСтр.Заявка = НСтр.Количество; 
				КонецЕсли;
				
				Если ЕстьРеквизитТабЧастиДокумента("ПодтвержденнаяЗаявка", ДокОбъект.Метаданные(), ИмяТабличнойЧасти) Тогда
					НСтр.ПодтвержденнаяЗаявка = НСтр.Количество; 
				КонецЕсли;
				
				РассчитатьСуммуТабЧасти(НСтр, ДокОбъект);
				
			КонецЦикла;
			
		КонецЦикла;
		
		Попытка
			ДокОбъект.Записать();
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = Строка(ДокОбъект) + " обновлен.";
			Сообщение.Сообщить();
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = Строка(ДокОбъект) + " Не могу обновить ТЧ " + ИмяТабличнойЧасти;
			Сообщение.Сообщить();
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////// КОМАНДЫ
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область Команды

&НаКлиенте
Процедура ЗаполнитьРасхожденияКоманда(Команда)
	ЗаполнитьРасхождения();
КонецПроцедуры

&НаКлиенте
Процедура ВыровнятьПоФиктивномуКП(Команда)
	тзВыборка = ВыгрузитьТЧ_НаСервере("КомплектующиеКП");
	ЗагрузитьТЧ_НаСервере(тзВыборка, "КомплектующиеЗАП")
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТоварыЗАП(Команда)
	
	ОповещениеВопрос = Новый ОписаниеОповещения("ОтветНаВопросОбновитьТовары", ЭтаФорма); 
	ПоказатьВопрос(ОповещениеВопрос,"Операция необратима!! Вы хотите обновить <Количество> в ТЧ Товары (ЗАП)?", РежимДиалогаВопрос.ОКОтмена); 	

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФиктивныеДокументы(Команда)
	
	ОповещениеВопрос = Новый ОписаниеОповещения("ОтветНаВопросЗагрузитьФиктивныеДокументы", ЭтаФорма); 
	ПоказатьВопрос(ОповещениеВопрос,"Операция необратима!! Вы хотите обновить <Количество> в фиктивных документах?", РежимДиалогаВопрос.ОКОтмена); 	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодогнатьКоличество(Команда)
	ПодогнатьКоличествоКП_Сервер();
КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьКП(Команда)
	
	Если ЗначениеЗаполнено(Объект.КП_фиктивный) Тогда
		
		тзКП = Обработки.СкорректироватьКомплектующие.РассчитатьКомплектующие(Объект.КП_фиктивный);
		ЗагрузитьТЧ_НаСервере(тзКП, "КомплектующиеКП");
		ЗаполнитьРасхождения();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьЗАП(Команда)
	
	Если ЗначениеЗаполнено(Объект.ЗАП_фиктивный) Тогда
		
		тзКП = Обработки.СкорректироватьКомплектующие.РассчитатьКомплектующие(Объект.ЗАП_фиктивный);
		ЗагрузитьТЧ_НаСервере(тзКП, "КомплектующиеЗАП");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

///////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////// ОБРАБОТЧИКИ КОМАНД
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОтветыНаВопросы

&НаКлиенте
Процедура ОтветНаВопросОбновитьТовары(ОтветНаВопрос, ДополнительныеПараметры) Экспорт 

	Если ОтветНаВопрос = КодВозвратаДиалога.ОК Тогда
		
		Если Объект.ДокОбъект <> Неопределено Тогда
		
			тзВыборка = ВыгрузитьТЧ_НаСервере("Комплектующие");
			ЗагрузитьТЧ_ПоСсылке_НаСервере(Объект.ДокОбъект, "Товары", тзВыборка);
			Оповестить("ОбновилиКоличество");
		
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтветНаВопросЗагрузитьФиктивныеДокументы(ОтветНаВопрос, ДополнительныеПараметры) Экспорт
	
	Если ОтветНаВопрос = КодВозвратаДиалога.ОК Тогда
		
		Если ЗначениеЗаполнено(Объект.КП_фиктивный) Тогда
			тзТовары = ВыгрузитьТЧ_НаСервере("КомплектующиеКП");
			Если тзТовары.Количество() > 0 Тогда
				ЗагрузитьТЧ_ПоСсылке_НаСервере(Объект.КП_фиктивный, "Товары", тзТовары);
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.ЗАП_фиктивный) Тогда
			тзТовары = ВыгрузитьТЧ_НаСервере("КомплектующиеЗАП");
			Если тзТовары.Количество() > 0 Тогда
				ЗагрузитьТЧ_ПоСсылке_НаСервере(Объект.ЗАП_фиктивный, "Товары", тзТовары);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
